<a href="https://colab.research.google.com/github/EvgeniiSopov/PrIS_3/blob/main/PrIS_06_03_2021_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Мини проект для работы с гит и гитхаб.

<h2> Exploratory data analysis (EDA) </h2>

<h2> Разветочный (исследовательский) анализ данных </h2>

<img src="http://sharpsightlabs.com/wp-content/uploads/2016/05/1_data-analysis-for-ML_how-we-use-dataAnalysis_2016-05-16.png">

# import packages

In [1]:
import pandas as pd
import numpy as np
from IPython.display import display

# import data

The study of classification of types of glass was motivated by criminological investigation. At the scene of the crime, the glass left can be used as evidence ... if it is correctly identified!

Attributes are:
1. Id number: 1 to 214
2. RI: refractive index
3. Na: Sodium 
4. Mg: Magnesium
5. Al: Aluminum
6. Si: Silicon
7. K: Potassium
8. Ca: Calcium
9. Ba: Barium
10. Fe: Iron
11. Type of glass

Type of glass:
1. building_windows_float_processed
2. building_windows_non_float_processed
3. vehicle_windows_float_processed
4. vehicle_windows_non_float_processed (none in this database)
5. containers
6. tableware
7. headlamps

In [2]:
data = pd.read_csv("http://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data", header=None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [3]:
names = ["Id","RI", "Na", "Mg", "Al", "Si", "K", "Ca", "Ba", "Fe", "Class"]
data.columns = names
data = data.drop(columns=['Id'])
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [7]:
data['Class'].replace(
                      {
                       1:"building_float", 
                       2:"building_non_float", 
                       3:"vehicle_float",
                       4:"vehicle_non_float", 
                       5:"containers", 
                       6:"tableware",
                       7:"headlamps"
                      }, inplace=True)
data.head(7)

        RI     Na    Mg    Al     Si     K    Ca   Ba    Fe           Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.00  building_float
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.00  building_float
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.00  building_float
3  1.51766  13.21  3.69  1.29  72.61  0.57  8.22  0.0  0.00  building_float
4  1.51742  13.27  3.62  1.24  73.08  0.55  8.07  0.0  0.00  building_float
5  1.51596  12.79  3.61  1.62  72.97  0.64  8.07  0.0  0.26  building_float
6  1.51743  13.30  3.60  1.14  73.09  0.58  8.17  0.0  0.00  building_float

In [9]:
for col in data.columns:
    fr = np.random.randint(5,10)/100
    data.loc[data.sample(frac=fr).index, col] = np.nan

# Data Vizualization

In [11]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      203 non-null    float64
 1   Na      197 non-null    float64
 2   Mg      197 non-null    float64
 3   Al      199 non-null    float64
 4   Si      201 non-null    float64
 5   K       199 non-null    float64
 6   Ca      197 non-null    float64
 7   Ba      197 non-null    float64
 8   Fe      199 non-null    float64
 9   Class   203 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [12]:
data.describe()

               RI          Na          Mg  ...          Ca          Ba          Fe
count  203.000000  197.000000  197.000000  ...  197.000000  197.000000  199.000000
mean     1.518364   13.395127    2.634162  ...    8.884112    0.166701    0.056683
std      0.003059    0.819633    1.469614  ...    1.332600    0.483020    0.098386
min      1.511150   10.730000    0.000000  ...    5.430000    0.000000    0.000000
25%      1.516540   12.900000    1.830000  ...    8.220000    0.000000    0.000000
50%      1.517680   13.300000    3.480000  ...    8.590000    0.000000    0.000000
75%      1.519155   13.810000    3.590000  ...    9.130000    0.000000    0.095000
max      1.533930   17.380000    4.490000  ...   14.960000    3.150000    0.510000

[8 rows x 9 columns]

In [16]:
display( data["Class"].describe() )
print("===========================")
display( data['Class'].value_counts() )

count                203
unique                 6
top       building_float
freq                  69
Name: Class, dtype: object

===========================

building_float        69
building_non_float    68
headlamps             28
vehicle_float         17
containers            12
tableware              9
Name: Class, dtype: int64